#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int main()
//{
//	float a = 6.0 / 5;
//	printf("%f\n", a);
//	return 0;
//}

//int main()
//{
	//int a = 2;
	//把a的二进制位向左移动1位，左边抛弃，右边补0
	//int b = a << 1;

	//int a = 10;
	////把a的二进制位向右移动1位
	//int b = a >> 1;

	//int a = -1;
	////把a的二进制位向右移动1位
	//int b = a >> 1;
	////当前的右移操作符使用的：算数右移，符号位不变
	//printf("b=%d\n",b);

//	return 0;
//}

//int main()
//{
//	//int a = 3;
//	//int b = 5;
//	////& - 按（2进制）位与
//	// 00000000000000000000000000000011
//	// 00000000000000000000000000000101
//	// 00000000000000000000000000000001
//	//int c = a & b;
//	//printf("c=%d\n", c);
//
//	//int a = 3;
//	//int b = 5;
//	////| - 按（2进制）位或
//	// 00000000000000000000000000000011
//	// 00000000000000000000000000000101
//	// 00000000000000000000000000000111
//	//int c = a | b;
//	//printf("c=%d\n", c);
//
//	int a = 3;
//	int b = 5;
//	//^ - 按（2进制）位异或
//	//规则：相同为0，相异为1
//	// 00000000000000000000000000000011
//	// 00000000000000000000000000000101
//	// 00000000000000000000000000000110
//	int c = a ^ b;
//	printf("c=%d\n", c);
//
//	return 0;
//}


//int main()
//{
//	int a = 13;
//	//把a的二进制数的第五位置成1
//	a = a | (1 << 4);
//	printf("a=%d\n", a);
//	//把a的二进制数的第五位置成0
//	a = a & ~(1 << 4);
//	printf("a=%d\n", a);
//	return 0;
//}
// 
//一个整数存储在内存中，求二进制数字中包含数字1的个数
//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	int count = 0;
//	int i = 0;
//	int temp = a;
//	for (i = 0;i < 31;i++)
//	{
//		if ((temp & 1) == 1)
//		{
//			count++;
//		}
//		temp=temp >> 1;
//	}
//	printf("%d的二进制数字中包含%d个数字1\n", a, count);
//	return 0;
//}

//int main()
//{
//	int flag = 5;
//	//flag为真，打印hehe
//	if (flag)
//	{
//		printf("hehe\n");
//	}
//	//flag为假，打印haha
//	if (!flag)
//	{
//		printf("haha\n");
//	}
//	return 0;
//}

//int main()
//{
//	short s = 5;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 2));
//	//sizeof()中的表达式是不参与运算的
//	printf("%d\n", s);
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001 原码
//	//11111111111111111111111111111110 反码
//	//11111111111111111111111111111111 补码
//	//~按位取反
//	//11111111111111111111111111111111
//	//00000000000000000000000000000000
//	int b = ~a;
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	printf("%d\n", a--);
//	printf("%d\n", a);
//	return 0;
//}

int main()
{
	int a = 10;
	printf("%p\n", &a);
	int *pa = &a;//& - 取地址操作符
	*pa = 20;;//pa是用来存放地址的 - pa就是一个指针变量
	printf("a=%d\n", a);//* - 解引用操作符 - 间接访问操作符
	return 0;
}