#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int main()
//{
//	float a = 6.0 / 5;
//	printf("%f\n", a);
//	return 0;
//}

//int main()
//{
	//int a = 2;
	//把a的二进制位向左移动1位，左边抛弃，右边补0
	//int b = a << 1;

	//int a = 10;
	////把a的二进制位向右移动1位
	//int b = a >> 1;

	//int a = -1;
	////把a的二进制位向右移动1位
	//int b = a >> 1;
	////当前的右移操作符使用的：算数右移，符号位不变
	//printf("b=%d\n",b);

//	return 0;
//}

//int main()
//{
//	//int a = 3;
//	//int b = 5;
//	////& - 按（2进制）位与
//	// 00000000000000000000000000000011
//	// 00000000000000000000000000000101
//	// 00000000000000000000000000000001
//	//int c = a & b;
//	//printf("c=%d\n", c);
//
//	//int a = 3;
//	//int b = 5;
//	////| - 按（2进制）位或
//	// 00000000000000000000000000000011
//	// 00000000000000000000000000000101
//	// 00000000000000000000000000000111
//	//int c = a | b;
//	//printf("c=%d\n", c);
//
//	int a = 3;
//	int b = 5;
//	//^ - 按（2进制）位异或
//	//规则：相同为0，相异为1
//	// 00000000000000000000000000000011
//	// 00000000000000000000000000000101
//	// 00000000000000000000000000000110
//	int c = a ^ b;
//	printf("c=%d\n", c);
//
//	return 0;
//}


//int main()
//{
//	int a = 13;
//	//把a的二进制数的第五位置成1
//	a = a | (1 << 4);
//	printf("a=%d\n", a);
//	//把a的二进制数的第五位置成0
//	a = a & ~(1 << 4);
//	printf("a=%d\n", a);
//	return 0;
//}
// 
//一个整数存储在内存中，求二进制数字中包含数字1的个数
//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	int count = 0;
//	int i = 0;
//	int temp = a;
//	for (i = 0;i < 31;i++)
//	{
//		if ((temp & 1) == 1)
//		{
//			count++;
//		}
//		temp=temp >> 1;
//	}
//	printf("%d的二进制数字中包含%d个数字1\n", a, count);
//	return 0;
//}

//int main()
//{
//	int flag = 5;
//	//flag为真，打印hehe
//	if (flag)
//	{
//		printf("hehe\n");
//	}
//	//flag为假，打印haha
//	if (!flag)
//	{
//		printf("haha\n");
//	}
//	return 0;
//}

//int main()
//{
//	short s = 5;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 2));
//	//sizeof()中的表达式是不参与运算的
//	printf("%d\n", s);
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001 原码
//	//11111111111111111111111111111110 反码
//	//11111111111111111111111111111111 补码
//	//~按位取反
//	//11111111111111111111111111111111
//	//00000000000000000000000000000000
//	int b = ~a;
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	printf("%d\n", a--);
//	printf("%d\n", a);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	printf("%p\n", &a);
//	int *pa = &a;//& - 取地址操作符
//	*pa = 20;;//pa是用来存放地址的 - pa就是一个指针变量
//	printf("a=%d\n", a);//* - 解引用操作符 - 间接访问操作符
//	return 0;
//}

//int main()
//{
//	//int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;//逻辑与操作，左边有一个假，结果为假，右侧表达式就不用计算了
//
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	i = a++ || ++b || d++;//逻辑或操作，左边有一个真，结果为真，右侧表达式就不用计算了
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n", a, b, c, d);
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = 0;
//	//if (a > 5)
//	//	b = 1;
//	//else
//	//	b = -1;
//
//	//三目操作符
//	b = (a > 5 ? 1 : -1);
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = 0;
//	//逗号表达式 - 要从左向右以此计算，但是整个表达式的结果是最后一个表达式的结果
//	int d = (c = 5, a = c + 3, b = a - 4, c += 5);
//	printf("%d\n", d);
//	return 0;
//}

//结构成员访问操作符
//.
//->

//结构体
//
//int float char short
//double long
//
//书：书名，书号，定价

//创建了一个自定义类型
//struct Book
//{
//	//结构体的成员(变量)
//	char name[20];
//	char id[20];
//	int price;
//};
//
//int main()
//{
//	int num = 10;
//	//结构体的成员名(变量名)
//	struct Book b = { "c语言", "c20221130", 55 };
//	struct Book* pb = &b;
//
//	//结构体指针->成员名
//	printf("书名：%s\n", pb->name);
//	printf("书号：%s\n", pb->id);
//	printf("价格：%d元\n", pb->price);
//
//	//printf("书名：%s\n", (*pb).name);
//	//printf("书号：%s\n", (*pb).id);
//	//printf("价格：%d元\n", (*pb).price);
//
//	//printf("书名：%s\n", b.name);
//	//printf("书号：%s\n", b.id);
//	//printf("价格：%d元\n", b.price);
//	return 0;
//}

//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000011
//	//00000011 - a
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111 - b
//
//	char c = a + b;
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010
//	// 
//	//10000010 - c
//	//11111111111111111111111110000010 - c的补码
//	//11111111111111111111111110000001 - c的反码
//	//10000000000000000000000001111110 - c的原码
//	//-126
//	//a和b都是char类型的，都没有达到一个int类型的大小
//	//在计算a+b时会发生整型提升，按照变量的数据类型的符号位
//
//	printf("%d\n", c);
//	return 0;
//}

int fun()
{
	static int count = 1;
    return ++count;

}

int main()
{
	int answer;
	answer = fun() - fun() * fun();//问题代码，函数调用优先顺序无法通过操作符的优先级确定
	printf("answer=%d\n", answer);
	return 0;

}

